[
  {
    "quote": "A coverall-clad spacer raced into view — and disintegrated, leaving only black dust where he had been. Cody stifled a hiss and ducked back, hoping he hadn’t been spotted.",
    "speaker": "Narrator",
    "chapter": "Chapter One",
    "location": "Early in the chapter, during Cody's work on the cargo shuttle Wasp.",
    "source": "Cody's War: Flight of the Hope",
    "author": "Todd J. McCaffrey"
  },
  {
    "quote": "“Holy shit!” Ellaz cried, pointing behind them. “They got everything!” Cody followed her finger with his head and his jaw dropped.",
    "speaker": "Ellaz",
    "chapter": "Chapter One",
    "location": "After escaping the freighter Hornet, witnessing the destruction of Parminter Station One and its orbiting habitats.",
    "source": "Cody's War: Flight of the Hope",
    "author": "Todd J. McCaffrey"
  },
  {
    "quote": "“We need to warn people,” Cody said. ... “We need a starship,” Cody said. ... “We need to build a starship,” Ellaz said.",
    "speaker": "Cody, then Ellaz",
    "chapter": "Chapter Two",
    "location": "During the discussion about the aliens' rapid destruction and humanity's limited time.",
    "source": "Cody's War: Flight of the Hope",
    "author": "Todd J. McCaffrey"
  },
  {
    "quote": "“Yes, I’m here,” Cody said, because Ellaz needed him to say that. Needed him to pull her — them — all three of them back to — “I’ve got you, don’t worry.”",
    "speaker": "Cody",
    "chapter": "Chapter Three",
    "location": "Cody mind-linking to rescue Ellaz and Jasmine when they get 'lost' in the simulation.",
    "source": "Cody's War: Flight of the Hope",
    "author": "Todd J. McCaffrey"
  },
  {
    "quote": "Gamma radiation, Ellaz admitted. A lethal dose. What? Why didn’t you say something? We could have — we could — We could have done nothing, Ellaz cut him off. I was already dying when I got aboard your shuttle. It was just a matter of time, nothing more.",
    "speaker": "Ellaz",
    "chapter": "Chapter Six",
    "location": "Ellaz's revelation to Cody about her fatal radiation poisoning from the energy converter.",
    "source": "Cody's War: Flight of the Hope",
    "author": "Todd J. McCaffrey"
  },
  {
    "quote": "Not me, Ellaz replied. I… uh… I’d like you to make my daughter, if you would. Your daughter? Ellen Whirly, Ellaz said. Pick the variants you think are best. Raise her for me, please? Okay, Cody replied immediately. Absolutely. One other thing, Ellaz thought. And you can say no. Shoot. Well, I was thinking. I mean it’s outside of everything I know but… Ford/Whirly? Maybe? You want me to make a clone of us? No, I want you to make a child, our child, Ellaz said.",
    "speaker": "Ellaz, then Cody",
    "chapter": "Chapter Eight",
    "location": "Ellaz's final, deeply personal request to Cody via mind-link.",
    "source": "Cody's War: Flight of the Hope",
    "author": "Todd J. McCaffrey"
  },
  {
    "quote": "Hope engaged the forward part of her ring, projecting a circular disk two thousand kilometers in front of her. “Got it!” Ellaz cried. “We’ve deflected their lance but… Cody!” “I see it!” Cody replied, twisting the ship in space so that its shielding warp mirror twisted the alien’s warp lance around — and back on the alien ship itself.",
    "speaker": "Narrator, Ellaz, Cody",
    "chapter": "Chapter Nine",
    "location": "The climactic moment when Hope activates its warp mirror to defend Elantra spacehab.",
    "source": "Cody's War: Flight of the Hope",
    "author": "Todd J. McCaffrey"
  },
  {
    "quote": "“They’re leaving!” “How many?” Cody said aloud. “All of them!” Nora crowed with glee. Cody! Ellaz warned him. Cody looked where she was pointing in virtual space. Oh, shit! “Eject, eject, eject!” Cody shouted, pushing the buttons that fired the remaining shuttles away from Hope. Those weren’t the right words, he realized. “Abandon ship!” Wasp flew away from Hope just as a large chunk of debris bounced off her warp ring, shattering it. Cody! Ellaz’s voice came to him. And then, it was gone. Just like Hope.",
    "speaker": "Nora, Cody, Ellaz, Narrator",
    "chapter": "Chapter Nine",
    "location": "The immediate aftermath of the successful defense, followed by Hope's destruction and Ellaz's final fading.",
    "source": "Cody's War: Flight of the Hope",
    "author": "Todd J. McCaffrey"
  }
]

